# SystemsAnalysisWorkfilesRootPath Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..SystemsAnalysisWorkfilesRootPath Property
Application Class See Also
---
Root path for systems analysis workfiles
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public string SystemsAnalysisWorkfilesRootPath { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SystemsAnalysisWorkfilesRootPath As String
	Get
```

Visual C++
---
```text
public:
property String^ SystemsAnalysisWorkfilesRootPath {
	String^ get ();
}
```

# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace